server/performanceTesting/test_02/summary.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
summary,30,1770,697,2513,740.31,0.000%,9.09366,21.12,4.73,2378.0
,90,1653,240,2987,724.65,0.000%,13.86749,16.64,8.27,1229.0
create,30,1692,440,2948,660.90,0.000%,5.43675,3.25,3.46,613.0
first question,30,1497,240,2987,742.14,0.000%,5.64122,3.83,3.57,696.0
TOTAL,180,1653,240,2987,724.65,0.000%,27.73498,33.29,16.54,1229.0